[{"id":1467207568901,"title":"My name is Beth and I'm a software developer living in Edinburgh.","body":"**Welcome to my page**! My name's Beth and I'm a student at CodeClan in Edinburgh. This is currently a sample page while I work on a portfolio creator tool I'm making - the contact details at the bottom are real though, so feel free to get in touch!\n<br><br>\nI've been living in Edinburgh for two years, and love the city. I'm originally from Northumberland, just south of the border. I'm currently nearing the end of a 16 week intensive course in software development at CodeClan, Scotland's first digital skills academy.","headerImage":"https://s3.amazonaws.com/StartupStockPhotos/uploads/41.jpg","contactInfo":"Get in touch - email is the easiest, or @ me on Twitter.","facebookURL":"http://www.facebook.com/","twitterURL":"http://www.twitter.com/edinbeth","email":"bethanyfraser@live.co.uk","projects":[{"image":"http://s27.postimg.org/ygazjhjyb/Screen_Shot_2016_03_08_at_16_06_21.png","info":"<h3>Project 1 - Festival Schedule Creator</h3>\n\nIndividual project based in Ruby on Rails: I created a festival scheduling app to aid festival goers in planning their weekend. Implemented user authentication using devise and clash prevention using custom validations. I took a mobile first approach to the design using CSS3 and media queries."},{"image":"http://s12.postimg.org/7awnd8971/Screen_Shot_2016_03_08_at_16_15_58.png","info":"<h3>Project 2 - Stock Portfolio App</h3>\n\nGroup project working in JavaScript using Node.js and Express, but without a front end framework. We created a single page app to display a portfolio of stocks and shares. Included real time notifications from an API, graphs and charts that would update when data changed, and error messages to prevent incorrect user input."},{"image":"http://s7.postimg.org/oalmyqr6z/Screen_Shot_2016_03_08_at_16_24_01.png","info":"<h3>Project 3 - Portfolio Creator</h3>\n\nIndividual project where we were free to come up with our own concept and choose the technologies that best fit. I worked to create a portfolio site builder for users of GitHub pages.\nLearned SASS for easier CSS editing. Used React, Webpack and made my own JavaScript API to deliver and save data."}]}]